# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..Size Property
ExternalApplicationArray Class See Also
---
Returns the number of objects that are in the array.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Size { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
virtual property int Size {
	int get ();
}
```

# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace